### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [11]:
import pandas as pd
df = pd.Series([4,8,15,16,23,42])
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [12]:
data = [1,2,3,4,5,6,7,8,9,10]
df = pd.Series(data)
df

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

In [13]:
data = {"Name":["Alice","Bob","claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

#### pandas.Series
##### One-dimensional	
##### Homogenous – Series elements must be of the same data type.
##### Size-immutable – Once created, the size of a Series object cannot be changed.	Size-mutable – Elements can be dropped or added in an existing DataFrame.

#### DataFrame
##### Two-dimensional
##### Heterogenous – DataFrame elements can have different data types.
##### Size-mutable – Elements can be dropped or added in an existing DataFrame.

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [15]:
data = {"Name":["Alice","Bob","claire","Johan","Joseph","Janvi","Arnab","Mansi"],"Age":[25,30,27,33,43,22,63,21],"Gender":["Female","Male","Female","Male","Male","Feamle","Male","Female"]}
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  claire   27  Female
3   Johan   33    Male
4  Joseph   43    Male
5   Janvi   22  Feamle
6   Arnab   63    Male
7   Mansi   21  Female

In [19]:
print(df.head())
# IF WE WANT TO SEE THE FIRST FEW ENTRIES WE CAN USE THE HEAD FUNCTION BYDEFAULT IT SHOWS THE FIRST 5 ROWS OF OUR DATASET

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  claire   27  Female
3   Johan   33    Male
4  Joseph   43    Male

In [21]:
print(df.tail())
# # IF WE WANT TO SEE THE LAST FEW ENTRIES WE CAN USE THE TAIL FUNCTION BYDEFAULT IT SHOWS THE LAST 5 ROWS OF OUR DATASET

     Name  Age  Gender
3   Johan   33    Male
4  Joseph   43    Male
5   Janvi   22  Feamle
6   Arnab   63    Male
7   Mansi   21  Female

In [25]:
df.describe()
# THIS FUNCTION TELLS THE STATISTICAL INFORMATION FOR THOSE COLUMN WHO CONTAINS INTEGER OR FLOATING DATATYPE

           Age
count   8.0000
mean   33.0000
std    14.0102
min    21.0000
25%    24.2500
50%    28.5000
75%    35.5000
max    63.0000

In [26]:
df.info()
# THIS FUNCTION IS USED TO TAKE THE INFORMATION OF OUR DATASET LIKE HOW MANY COLUMN, NULL VALUES, DATATYPES ETC.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   Gender  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

#### A Series is mutable by values,means we can change the values by excessing their index but the size of the series is immutable,means once the size of an series is declared we cannot extend it
#### A DataFrame is mutable
#### A panel is also mutable

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [29]:
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])
df=pd.concat([courses,fees,discount],axis=1)
df.columns = ["A","B","C"]
print(df)

         A      B     C
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000